/* 3. Написать статический метод и показать пример его корректного вызова в другом
классе
 */
package core;

public class Task5_1 {

	public static void main(String[] args) {
		System.out.println(Tester.getAge());
		
	}

}
